Repository: Isrofilov/WinControlBot
Catalog: Resources/Strings.*.resx
Languages: ru

# Settings_Title
source: Bot Settings
ru: Настройки бота

# Settings_BotToken
source: Bot Token:
ru: Токен бота:

# Settings_AuthorizedUsers
source: User IDs:
ru: ID пользователей:

# Settings_AuthorizedUsers.Tooltip
source: IDs separated by commas
ru: ID через запятую

# Settings_Save
source: Save
ru: Сохранить

# Settings_ShowToken
source: Show token
ru: Показать токен

# Settings_HideToken
source: Hide token
ru: Скрыть токен

# Controls_Start
source: ▶️ Start
ru: ▶️ Запустить

# Controls_Stop
source: ⏹️ Stop
ru: ⏹️ Остановить

# Controls_Restart
source: 🔄 Restart
ru: 🔄 Перезапустить

# Controls_Starting
source: ⏳ Starting...
ru: ⏳ Запускается...

# Controls_Stopping
source: ⏳ Stopping...
ru: ⏳ Останавливается...

# Controls_Restarting
source: ⏳ Restarting...
ru: ⏳ Перезапускается...

source: Status: 🟢 Running
ru: Статус: 🟢 Запущен

source: Status: 🔴 Stopped
ru: Статус: 🔴 Остановлен

source: Autostart: Enabled
ru: Автозагрузка: Вкл

source: Autostart: Disabled
ru: Автозагрузка: Выкл

# AutoStart_Tooltip
source: Toggle application autostart
ru: Переключить автозагрузку

# Log_Title
source: Event Log
ru: Лог событий

# Log_Clear
source: Clear Log
ru: Очистить лог

source: Log cleared
ru: Лог очищен

# Language_Label
source: Language:
ru: Язык:

# Language_English
source: English
ru: Английский

# Language_Russian
source: Russian
ru: Русский

# Language_Tooltip
source: Change language
ru: Изменить язык

# Tray_Show
source: Show Window
ru: Показать окно

# Tray_Hide
source: Hide to Tray
ru: Скрыть в трей

# Tray_Exit
source: Exit
ru: Выход

# Tray_Running
source: WinControlBot - Running
ru: WinControlBot - Запущен

# Tray_Stopped
source: WinControlBot - Stopped
ru: WinControlBot - Остановлен

# Tray_Notification.Message
source: Application continues running in tray. Double-click the icon to return.
ru: Программа продолжает работать в трее. Дважды кликните по иконке для возврата.

# Log_SettingsLoaded
source: ✅ Settings loaded
ru: ✅ Настройки загружены

# Log_SettingsSaved
source: ✅ Settings saved
ru: ✅ Настройки сохранены

# Log_SettingsSavePath
source: 📁 Settings path: {0}
ru: 📁 Путь к настройкам: {0}

# Log_TokenSaved
source: 🔑 Token: {0}...
ru: 🔑 Токен: {0}...

# Log_UsersSaved
source: 👥 Users: {0}
ru: 👥 Пользователей: {0}

# Log_AutoStarting
source: ⏳ Auto-starting bot...
ru: ⏳ Автозапуск бота...

# Log_AutoStartSkipped
source: ⚠️ Auto-start skipped: missing token or users
ru: ⚠️ Автозапуск пропущен: нет токена или пользователей

# Log_BotStarted
source: ✅ Bot started successfully
ru: ✅ Бот успешно запущен

# Log_BotStopped
source: ✅ Bot stopped
ru: ✅ Бот остановлен

# Log_BotRestarted
source: 🔄 Bot restarted
ru: 🔄 Бот перезапущен

# Log_ApplicationExit
source: 🔄 Exiting application...
ru: 🔄 Завершение работы приложения...

# Log_StoppingBot
source: ⏳ Stopping bot...
ru: ⏳ Останавливаем бот...

# Log_AutoStartEnabled
source: ✅ Autostart enabled
ru: ✅ Автозагрузка включена

# Log_AutoStartDisabled
source: ✅ Autostart disabled
ru: ✅ Автозагрузка отключена

# Log_CurrentPath
source: 📁 Current application path: {0}
ru: 📁 Текущий путь приложения: {0}

# Log_LocalizationInitialized
source: 🌍 Localization initialized
ru: 🌐 Локализация инициализирована

# Log_LanguageChanged
source: 🌍 Language changed
ru: 🌐 Язык изменен

# Error_SettingsLoad
source: ❌ Error loading settings: {0}
ru: ❌ Ошибка загрузки настроек: {0}

# Error_SettingsSave
source: ❌ Error saving settings: {0}
ru: ❌ Ошибка сохранения настроек: {0}

# Error_BotStart
source: ❌ Error starting bot: {0}
ru: ❌ Ошибка запуска бота: {0}

# Error_BotStop
source: ❌ Error stopping bot: {0}
ru: ❌ Ошибка остановки бота: {0}

# Error_AutoStart
source: ❌ Auto-start error: {0}
ru: ❌ Ошибка автозапуска: {0}

# Error_AutoStartChange
source: ❌ Error changing autostart: {0}
ru: ❌ Ошибка изменения автозагрузки: {0}

# Error_AutoStartStatus
source: ❌ Error updating autostart status: {0}
ru: ❌ Ошибка обновления статуса автозагрузки: {0}

# Error_TrayInit
source: ⚠️ Error initializing tray: {0}
ru: ⚠️ Ошибка инициализации трея: {0}

# Error_TrayUpdate
source: ⚠️ Error updating tray: {0}
ru: ⚠️ Ошибка обновления трея: {0}

# Error_TrayCleanup
source: ⚠️ Error cleaning up tray: {0}
ru: ⚠️ Ошибка очистки трея: {0}

# Error_ShowWindow
source: ⚠️ Error showing window: {0}
ru: ⚠️ Ошибка показа окна: {0}

# Error_HideWindow
source: ⚠️ Error hiding window: {0}
ru: ⚠️ Ошибка сворачивания в трей: {0}

# Error_WindowState
source: ⚠️ Error changing window state: {0}
ru: ⚠️ Ошибка изменения состояния окна: {0}

# Error_TokenToggle
source: ❌ Error toggling token visibility: {0}
ru: ❌ Ошибка переключения видимости токена: {0}

# Error_IconLoad
source: ⚠️ Failed to load icon: {0}
ru: ⚠️ Не удалось загрузить иконку: {0}

# Error_Exit
source: ❌ Error during exit: {0}
ru: ❌ Ошибка при завершении: {0}

# Error_Closing
source: ❌ Error during closing: {0}
ru: ❌ Ошибка при закрытии: {0}

# Error_Critical
source: Critical error: {0}\n\nDetails: {1}
ru: Критическая ошибка: {0}\\n\\nДетали: {1}

# Error_Startup
source: Critical error starting application: {0}\n\nDetails: {1}
ru: Критическая ошибка при запуске приложения: {0}\\n\\nДетали: {1}

# Error_StartupTitle
source: Startup Error
ru: Ошибка запуска

# Error_LanguageSelector
source: ⚠️ Error initializing language selector: {0}
ru: ⚠️ Ошибка инициализации выбора языка: {0}

# Error_UIUpdate
source: ⚠️ Error updating UI after language change: {0}
ru: ⚠️ Ошибка обновления UI после смены языка: {0}

# Error_LanguageChange
source: ⚠️ Error changing language: {0}
ru: ⚠️ Ошибка смены языка: {0}

# Validation_EmptyToken
source: Please enter bot token!
ru: Введите токен бота!

# Validation_EmptyUsers
source: Please specify at least one authorized user!
ru: Укажите хотя бы одного авторизованного пользователя!

# Validation_EmptyTokenWarning
source: ⚠️ Token is empty, save cancelled
ru: ⚠️ Токен пустой, сохранение отменено

# Dialog_Error
source: Error
ru: Ошибка

# Dialog_Warning
source: Warning
ru: Предупреждение"

# Bot_InvalidToken
source: ❌ Invalid bot token
ru: ❌ Неверный токен бота

# Bot_TokenValidationError
source: ❌ Token validation error: {0}
ru: ❌ Ошибка проверки токена: {0}

# Bot_Conflict
source: ⚠️ Conflict: bot is already running elsewhere
ru: ⚠️ Конфликт: бот уже запущен в другом месте

# Bot_PollingCancelled
source: ℹ️ Polling updates cancelled
ru: ℹ️ Опрос обновлений отменен

# Bot_CriticalError
source: ❌ Critical error: {0}
ru: ❌ Критическая ошибка: {0}

# Bot_PollError
source: ❌ Polling error: {0}
ru: ❌ Ошибка polling: {0}

# Bot_MessageReceived
source: 📩 Message from {0}: {1}
ru: 📩 Сообщение от {0}: {1}

# Bot_UnauthorizedAccess
source: 🚫 Unauthorized access attempt from user {0}
ru: 🚫 Неавторизованная попытка доступа от пользователя {0}

# Bot_ExecutingCommand
source: ⚙️ Executing command: {0}
ru: ⚙️ Выполняется команда: {0}

# Bot_CommandOutput
source: 📜 Command output: {0}
ru: 📜 Вывод команды: {0}

# Bot_CommandError
source: ❌ Command error: {0}
ru: ❌ Ошибка выполнения команды: {0}

# Bot_CommandKilled
source: ❌ Command was forcefully terminated due to timeout
ru: ❌ Команда была принудительно завершена по таймауту

# Bot_CommandExitCode
source: ❌ Command finished with error code: {0}
ru: ❌ Команда завершилась с кодом ошибки: {0}

# Bot_CommandErrorDetails
source: ❌ Error details: {0}
ru: ❌ Детали ошибки: {0}

# Bot_CommandExecuted
source: ✅ System command executed: {0}
ru: ✅ Выполнена системная команда: {0}

# Bot_CommandExecutionError
source: ❌ Command execution error: {0}
ru: ❌ Ошибка выполнения команды: {0}

# Bot_SystemStatusError
source: ❌ System status error: {0}
ru: ❌ Ошибка получения статуса системы: {0}

# Bot_ScreenshotsFound
source: ✅ Found {0} screens for screenshot
ru: ✅ Найдено {0} экранов для скриншота

# Bot_AllScreenshotsSent
source: ✅ All screenshots sent ({0} monitors)
ru: ✅ Все скриншоты отправлены ({0} мониторов)

# Bot_SendMessageRetry
source: ⚠️ Too many requests, retrying in {0} ms
ru: ⚠️ Слишком много запросов, повтор через{0} мс

# Bot_SendMessageError
source: ❌ Message send error (attempt {0}): {1}
ru: ❌ Ошибка отправки сообщения(попытка{0}): {1}

# Bot_SendPhotoError
source: ❌ Photo send error (attempt {0}): {1}
ru: ❌ Ошибка отправки фото (попытка {0}): {1}

# Validation_MissingToken
source: Please enter bot token!
ru: Введите токен бота!

# Validation_MissingUsers
source: Please specify at least one authorized user!
ru: Укажите хотя бы одного авторизованного пользователя!

# Window_SettingsLoaded
source: ✅ Settings loaded
ru: ✅ Настройки загружены

# Window_SettingsPath
source: 📁 Settings path: {0}
ru: 📁 Путь к настройкам: {0}

# Window_SettingsSaved
source: ✅ Settings saved
ru: ✅ Настройки сохранены

# Window_TokenSaved
source: 🔑 Token: {0}...
ru: 🔑 Токен: {0}...

# Window_UserCount
source: 👥 Users: {0}
ru: 👥 Пользователей: {0}

# Window_EmptyTokenSave
source: ⚠️ Token is empty, save cancelled
ru: ⚠️ Токен пустой, сохранение отменено

# Window_AutoStartSkipped
source: ⚠️ Auto-start skipped: missing token or users
ru: ⚠️ Автозапуск пропущен: нет токена или пользователей

# Window_BotStopped
source: ✅ Bot stopped
ru: ✅ Бот остановлен

# Window_CurrentPath
source: 📁 Current application path: {0}
ru: 📁 Текущий путь приложения: {0}

# TrayMenu_Show
source: Show Window
ru: Показать окно

# TrayMenu_Hide
source: Hide to Tray
ru: Скрыть в трей

# TrayMenu_Exit
source: Exit
ru: Выход

# TrayMenu_Running
source: Running
ru: Запущен

# TrayMenu_Stopped
source: Stopped
ru: Остановлен

# Button_Starting
source: ⏳ Starting...
ru: ⏳ Запускается...

# Button_Stopping
source: ⏳ Stopping...
ru: ⏳ Останавливается...

# Button_Restarting
source: ⏳ Restarting...
ru: ⏳ Перезапускается...

# Button_Start
source: ▶️ Start
ru: ▶️ Запустить

# Button_Stop
source: ⏹️ Stop
ru: ⏹️ Остановить

# Button_Restart
source: 🔄 Restart
ru: 🔄 Перезапустить

# Notification_ContinuesInTray
source: Application continues running in tray. Double-click the icon to return.
ru: Программа продолжает работать в трее. Дважды кликните по иконке для возврата

# Bot_DisposeError
source: ❌ Error during disposal: {0}
ru: ❌ Ошибка при завершении: {0}

# Bot_Unauthorized
source: 🚫 You do not have permission to execute this command. Your userId is {0}
ru: 🚫 У вас нет прав для выполнения этой команды. Ваш userId {0}

# Bot_Welcome_Message
source: 🤖 Welcome to WinControlBot! Choose a command:
ru: 🤖 Добро пожаловать в WinControlBot! Выберите команду:

# Bot_Keyboard_Status
source: 📋 Status
ru: 📋 Статус

# Bot_Keyboard_Screenshot
source: 📸 Screenshot
ru: 📸 Скриншот

# Bot_Keyboard_Sleep
source: 😴 Sleep
ru: 😴 Сон

# Bot_Keyboard_Hibernate
source: 💤 Hibernate
ru: 💤 Гибернация

# Bot_Keyboard_Shutdown
source: Keyboard_Shutdown
ru: 🔴 Выключить

# Bot_Keyboard_Restart
source: 🔄 Restart
ru: 🔄 Перезагрузка

# Bot_Sleep
source: 😴 The computer will be put to sleep...
ru: 😴 Компьютер будет отправлен в режим сна...

# Bot_Hibernate
source: 💤 The computer will be hibernated...
ru: 💤 Компьютер будет отправлен в режим гибернации...

# Bot_Shutdown
source: 🔴 Shutting down the computer...
ru: 🔴 Выключаю компьютер...

# Bot_Restart
source: 🔄 Restarting the computer...
ru: 🔄 Перезагружаю компьютер...

# Bot_Status
source: 🖥️ System Status: 💻 Computer: {0} ⚙️ Processor: {1} 💾 RAM: {6:F1} GB / {7:F0} GB ⏱️ Uptime: {2}d {3}h {4}m {5}s
ru: 🖥️ Статус системы: 💻 Компьютер: {0} ⚙️ Процессор: {1} 💾 ОЗУ: {6:F1} ГБ / {7:F0} ГБ ⏱️ Время работы: {2}д {3}ч {4}м {5}с

# Bot_Retry_Request
source: ⚠️ The request is outdated. Please send it again.
ru: ⚠️ Запрос устарел. Пожалуйста, отправьте его снова.

# Bot_Command_Executing
source: ⏳ Executing command...
ru: ⏳ Выполняю команду...

# Bot_Error_Occurred
source: ❌ An error occurred: {0}
ru: ❌ Произошла ошибка: {0}

# Bot_Screenshot_Taken
source: 📸 Screenshot taken
ru: 📸 Скриншот сделан

# Bot_Screenshot_Error
source: ❌ Failed to take screenshot: {0}
ru: ❌ Не удалось сделать скриншот: {0}

# Bot_File_Too_Large
source: ❌ Screenshot file is too large to send ({0:F1} MB). Maximum size: {1} MB
ru: ❌ Файл скриншота слишком большой для отправки ({0:F1} МБ). Максимальный размер: {1} МБ

# Bot_Screenshot_Monitor
source: 📸 Screenshot {0} of {1}
ru: 📸 Скриншот {0} из {1}
